import pandas as pd
from preprocess import preprocess

import os

print("現在の作業ディレクトリ:", os.getcwd())

# 使用する特徴量
features = [
    "レースID",
    "レース日付",
    "芝・ダート区分",
    "距離(m)",
    "馬齢",
    "馬体重",
    "性別",
    "斤量",
    "馬体重増減",
    "競馬場名",
    "馬場状態1",
    "右左回り・直線区分",
    "枠番",
    "天候",
    "人気",
    "単勝",
    "過去3走複勝率",
    "過去5走複勝率",
    "前走着順",
    "過去3走平均着順",
    "過去5走平均着順",
    "前走上り",
    "過去3走平均上り",
    "過去5走平均上り",
    "騎手複勝率",
    "調教師複勝率",
    "休養日数",
    "芝・ダート別複勝率",
    "競馬場別複勝率",
    "距離帯",
    "距離帯別複勝率",
    "レースクラス",
    "レースグレード",
    "過去3走平均着順順位率",
    "過去5走平均着順順位率",
    "過去3走平均上り順位率",
    "過去5走平均上り順位率",
    "過去3走複勝率順位率",
    "過去5走複勝率順位率",
    "騎手複勝率順位率",
    "調教師複勝率順位率",
    "芝・ダート別複勝率順位率",
    "距離帯別複勝率順位率",
    "競馬場別複勝率順位率",
    "過去3走平均着順標準化",
    "過去5走平均着順標準化",
    "過去3走平均上り標準化",
    "過去5走平均上り標準化",
    "過去3走複勝率標準化",
    "過去5走複勝率標準化",
    "騎手複勝率標準化",
    "調教師複勝率標準化",
    "芝・ダート別複勝率標準化",
    "距離帯別複勝率標準化",
    "競馬場別複勝率標準化",
    "着順",  # preprocess()内で「複勝」を作るために必要

    # 順位率
    "斤量順位率",
    "馬齢順位率",
    "馬体重順位率",
    "馬体重増減順位率",
    "休養日数順位率",

    # 標準化
    "斤量標準化",
    "馬齢標準化",
    "馬体重標準化",
    "馬体重増減標準化",
    "休養日数標準化",

    "馬番",
]

# 生データを読み込む
df = pd.read_csv(
    "../data/19860105-20210731_race_result.csv",
    low_memory=False
)

df["レース日付"] = pd.to_datetime(df["レース日付"])

print(df["レース日付"].head())
# 前処理
df = preprocess(df, features)

# 前処理済みデータを保存
df.to_csv("../data/features.csv", index=False)

print("features.csv を作成しました。")

print(df["レース日付"].head())